backend/TransactionSign.Tests/LoadTests/results/20260415-043550/k6-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Davit Gabrielyan\source\repos\TransactionSign\backend\TransactionSign.Tests\LoadTests\k6-workflow.js
        output: -

     scenarios: (100.00%) 2 scenarios, 31 max VUs, 30m5s max duration (incl. graceful stop):
              * monitor: 1 looping VUs for 30m0s (exec: monitorCompletion)
              * signers: 30 looping VUs for 30m0s (exec: signerFlow, gracefulStop: 5s)

time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.642Z\",\"kind\":\"sign_fail\",\"userId\":4,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.644Z\",\"kind\":\"sign_fail\",\"userId\":7,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.661Z\",\"kind\":\"sign_fail\",\"userId\":26,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.762Z\",\"kind\":\"sign_fail\",\"userId\":24,\"txId\":2248,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.769Z\",\"kind\":\"sign_fail\",\"userId\":30,\"txId\":3,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.814Z\",\"kind\":\"sign_fail\",\"userId\":16,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.843Z\",\"kind\":\"sign_fail\",\"userId\":9,\"txId\":4,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.892Z\",\"kind\":\"sign_fail\",\"userId\":22,\"txId\":2,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.893Z\",\"kind\":\"sign_fail\",\"userId\":23,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:51+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:51.918Z\",\"kind\":\"sign_fail\",\"userId\":25,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console

running (00m01.0s), 31/31 VUs, 24 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m01.0s/30m0s
signers   [   0% ] 30 VUs  00m01.0s/30m0s
time="2026-04-15T04:35:52+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:52.182Z\",\"kind\":\"sign_fail\",\"userId\":29,\"txId\":4,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:52+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:52.255Z\",\"kind\":\"sign_fail\",\"userId\":17,\"txId\":2247,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:52+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:52.324Z\",\"kind\":\"sign_fail\",\"userId\":20,\"txId\":2247,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:52+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:52.368Z\",\"kind\":\"sign_fail\",\"userId\":25,\"txId\":2247,\"error\":\"Transaction not eligible for signing\"}" source=console

running (00m02.0s), 31/31 VUs, 30 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m02.0s/30m0s
signers   [   0% ] 30 VUs  00m02.0s/30m0s

running (00m03.0s), 31/31 VUs, 30 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m03.0s/30m0s
signers   [   0% ] 30 VUs  00m03.0s/30m0s

running (00m04.0s), 31/31 VUs, 31 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m04.0s/30m0s
signers   [   0% ] 30 VUs  00m04.0s/30m0s

running (00m05.0s), 31/31 VUs, 31 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m05.0s/30m0s
signers   [   0% ] 30 VUs  00m05.0s/30m0s

running (00m06.0s), 31/31 VUs, 31 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m06.0s/30m0s
signers   [   0% ] 30 VUs  00m06.0s/30m0s

running (00m07.0s), 31/31 VUs, 31 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m07.0s/30m0s
signers   [   0% ] 30 VUs  00m07.0s/30m0s

running (00m08.0s), 31/31 VUs, 31 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m08.0s/30m0s
signers   [   0% ] 30 VUs  00m08.0s/30m0s
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.486Z\",\"kind\":\"sign_fail\",\"userId\":18,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.504Z\",\"kind\":\"sign_fail\",\"userId\":8,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.505Z\",\"kind\":\"sign_fail\",\"userId\":22,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.505Z\",\"kind\":\"sign_fail\",\"userId\":4,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.505Z\",\"kind\":\"sign_fail\",\"userId\":32,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.505Z\",\"kind\":\"sign_fail\",\"userId\":30,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.518Z\",\"kind\":\"sign_fail\",\"userId\":9,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.518Z\",\"kind\":\"sign_fail\",\"userId\":6,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.518Z\",\"kind\":\"sign_fail\",\"userId\":17,\"txId\":2245,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.518Z\",\"kind\":\"sign_fail\",\"userId\":12,\"txId\":2245,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.521Z\",\"kind\":\"sign_fail\",\"userId\":15,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.522Z\",\"kind\":\"sign_fail\",\"userId\":24,\"txId\":2245,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.523Z\",\"kind\":\"sign_fail\",\"userId\":19,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.523Z\",\"kind\":\"sign_fail\",\"userId\":25,\"txId\":2245,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.523Z\",\"kind\":\"sign_fail\",\"userId\":16,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.523Z\",\"kind\":\"sign_fail\",\"userId\":21,\"txId\":2244,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.523Z\",\"kind\":\"sign_fail\",\"userId\":26,\"txId\":2245,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.527Z\",\"kind\":\"sign_fail\",\"userId\":5,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.527Z\",\"kind\":\"sign_fail\",\"userId\":27,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.529Z\",\"kind\":\"sign_fail\",\"userId\":29,\"txId\":2246,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.659Z\",\"kind\":\"sign_fail\",\"userId\":14,\"txId\":4,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.783Z\",\"kind\":\"sign_fail\",\"userId\":13,\"txId\":2245,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.812Z\",\"kind\":\"sign_fail\",\"userId\":23,\"txId\":2245,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.951Z\",\"kind\":\"sign_fail\",\"userId\":7,\"txId\":2245,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.964Z\",\"kind\":\"sign_fail\",\"userId\":31,\"txId\":2244,\"error\":\"Transaction not eligible for signing\"}" source=console

running (00m09.0s), 31/31 VUs, 59 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m09.0s/30m0s
signers   [   0% ] 30 VUs  00m09.0s/30m0s
time="2026-04-15T04:35:59+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T00:35:59.994Z\",\"kind\":\"sign_fail\",\"userId\":10,\"txId\":2244,\"error\":\"Transaction not eligible for signing\"}" source=console

running (00m10.0s), 31/31 VUs, 96 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m10.0s/30m0s
signers   [   1% ] 30 VUs  00m10.0s/30m0s
time="2026-04-15T04:36:01+04:00" level=info msg="{\"level\":\"info\",\"action\":\"complete\",\"message\":\"All transactions signed\",\"ts\":\"2026-04-15T00:36:01.176Z\"}" source=console

running (00m11.0s), 31/31 VUs, 137 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m11.0s/30m0s
signers   [   1% ] 30 VUs  00m11.0s/30m0s

running (00m12.0s), 31/31 VUs, 172 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m12.0s/30m0s
signers   [   1% ] 30 VUs  00m12.0s/30m0s

running (00m13.0s), 31/31 VUs, 208 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m13.0s/30m0s
signers   [   1% ] 30 VUs  00m13.0s/30m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 348     26.384912/s
    checks_succeeded...: 100.00% 348 out of 348
    checks_failed......: 0.00%   0 out of 348

    ✓ pending 200
    ✓ sign 200

    CUSTOM
    signing_duration_ms............: avg=2803.9   min=1        med=33.5     max=7925   p(90)=7394.1  p(95)=7739.7
    successful_signs...............: 20     1.516374/s
    workflow_failures..............: 40     3.032749/s

    HTTP
    http_req_duration..............: avg=634.97ms min=432.7µs  med=3.7ms    max=7.92s  p(90)=73.81ms p(95)=7.13s 
      { expected_response:true }...: avg=634.97ms min=432.7µs  med=3.7ms    max=7.92s  p(90)=73.81ms p(95)=7.13s 
    http_req_failed................: 0.00%  0 out of 348
    http_reqs......................: 348    26.384912/s

    EXECUTION
    iteration_duration.............: avg=1.83s    min=340.04ms med=835.32ms max=13.18s p(90)=7.69s   p(95)=8s    
    iterations.....................: 216    16.376842/s
    vus............................: 31     min=31       max=31
    vus_max........................: 31     min=31       max=31

    NETWORK
    data_received..................: 189 kB 14 kB/s
    data_sent......................: 42 kB  3.2 kB/s



running (00m13.2s), 00/31 VUs, 215 complete and 36 interrupted iterations
monitor ✗ [   1% ] 1 VUs   00m13.2s/30m0s
signers ✗ [   1% ] 30 VUs  00m13.2s/30m0s
time="2026-04-15T04:36:04+04:00" level=error msg="test aborted: All transactions signed - test complete at monitorCompletion (file:///C:/Users/Davit%20Gabrielyan/source/repos/TransactionSign/backend/TransactionSign.Tests/LoadTests/k6-workflow.js:177:24(88))"